sownlee/MCAL/env/STM32F407VG/header/Header_FLASH.h
#if !defined(HEADER_FLASH_H_)  
#define HEADER_FLASH_H_

#include "Header.h"


typedef struct
{
  __IO uint32_t ACR;      /* FLASH access control register  */
  __IO uint32_t KEYR;     /* FLASH key register             */
  __IO uint32_t OPTKEYR;  /* FLASH option key register      */
  __IO uint32_t SR;       /* FLASH status register          */
  __IO uint32_t CR;       /* FLASH control register         */
  __IO uint32_t OPTCR;    /* FLASH option control register  */
  __IO uint32_t OPTCR1;   /* FLASH option control register 1*/
} FLASH_RegDef_t;
#define FLASH               ((FLASH_RegDef_t *) FLASH_R_BASEADDR)

/** 
  *  Flexible Static Memory Controller
  */

typedef struct
{
  __IO uint32_t BTCR[8];    /* NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR) */   
} FSMC_Bank1_TypeDef;
#define FSMC_Bank1          ((FSMC_Bank1_TypeDef *) FSMC_Bank1_R_BASE)

/** 
  *  Flexible Static Memory Controller Bank1E
  */

typedef struct
{
  __IO uint32_t BWTR[7];    /* NOR/PSRAM write timing registers */
} FSMC_Bank1E_TypeDef;
#define FSMC_Bank1E         ((FSMC_Bank1E_TypeDef *) FSMC_Bank1E_R_BASE)

/** 
  *  Flexible Static Memory Controller Bank2
  */
  
typedef struct
{
  __IO uint32_t PCR2;       /* NAND Flash control register 2,                        */
  __IO uint32_t SR2;        /* NAND Flash FIFO status and interrupt register 2,      */
  __IO uint32_t PMEM2;      /* NAND Flash Common memory space timing register 2,     */
  __IO uint32_t PATT2;      /* NAND Flash Attribute memory space timing register 2,  */
  uint32_t      RESERVED0;  /* Reserved, 0x70                                        */
  __IO uint32_t ECCR2;      /* NAND Flash ECC result registers 2,                    */
  uint32_t      RESERVED1;  /* Reserved, 0x78                                        */
  uint32_t      RESERVED2;  /* Reserved, 0x7C                                        */
  __IO uint32_t PCR3;       /* NAND Flash control register 3,                        */
  __IO uint32_t SR3;        /* NAND Flash FIFO status and interrupt register 3,      */
  __IO uint32_t PMEM3;      /* NAND Flash Common memory space timing register 3,     */
  __IO uint32_t PATT3;      /* NAND Flash Attribute memory space timing register 3,  */
  uint32_t      RESERVED3;  /* Reserved, 0x90                                        */
  __IO uint32_t ECCR3;      /* NAND Flash ECC result registers 3,                    */
} FSMC_Bank2_3_TypeDef;
#define FSMC_Bank2_3        ((FSMC_Bank2_3_TypeDef *) FSMC_Bank2_3_R_BASE)

/** 
  *  Flexible Static Memory Controller Bank4
  */

typedef struct
{
  __IO uint32_t PCR4;       /* PC Card  control register 4,                       */
  __IO uint32_t SR4;        /* PC Card  FIFO status and interrupt register 4,     */
  __IO uint32_t PMEM4;      /* PC Card  Common memory space timing register 4,    */
  __IO uint32_t PATT4;      /* PC Card  Attribute memory space timing register 4, */
  __IO uint32_t PIO4;       /* PC Card  I/O space timing register 4,              */
} FSMC_Bank4_TypeDef; 
#define FSMC_Bank4          ((FSMC_Bank4_TypeDef *) FSMC_Bank4_R_BASE)



/*******************  Bits definition for FLASH_ACR register  *****************/
#define FLASH_ACR_LATENCY_Pos          (0U)
#define FLASH_ACR_LATENCY_Msk          (0x7UL << FLASH_ACR_LATENCY_Pos)       
#define FLASH_ACR_LATENCY              FLASH_ACR_LATENCY_Msk
#define FLASH_ACR_LATENCY_0WS          0x00000000U
#define FLASH_ACR_LATENCY_1WS          0x00000001U
#define FLASH_ACR_LATENCY_2WS          0x00000002U
#define FLASH_ACR_LATENCY_3WS          0x00000003U
#define FLASH_ACR_LATENCY_4WS          0x00000004U
#define FLASH_ACR_LATENCY_5WS          0x00000005U
#define FLASH_ACR_LATENCY_6WS          0x00000006U
#define FLASH_ACR_LATENCY_7WS          0x00000007U

#define FLASH_ACR_PRFTEN_Pos           (8U)                                    
#define FLASH_ACR_PRFTEN_Msk           (0x1UL << FLASH_ACR_PRFTEN_Pos)         
#define FLASH_ACR_PRFTEN               FLASH_ACR_PRFTEN_Msk                   
#define FLASH_ACR_ICEN_Pos             (9U)                                   
#define FLASH_ACR_ICEN_Msk             (0x1UL << FLASH_ACR_ICEN_Pos)           
#define FLASH_ACR_ICEN                 FLASH_ACR_ICEN_Msk                     
#define FLASH_ACR_DCEN_Pos             (10U)                                  
#define FLASH_ACR_DCEN_Msk             (0x1UL << FLASH_ACR_DCEN_Pos)           
#define FLASH_ACR_DCEN                 FLASH_ACR_DCEN_Msk                     
#define FLASH_ACR_ICRST_Pos            (11U)                                  
#define FLASH_ACR_ICRST_Msk            (0x1UL << FLASH_ACR_ICRST_Pos)          
#define FLASH_ACR_ICRST                FLASH_ACR_ICRST_Msk                    
#define FLASH_ACR_DCRST_Pos            (12U)                                  
#define FLASH_ACR_DCRST_Msk            (0x1UL << FLASH_ACR_DCRST_Pos)          
#define FLASH_ACR_DCRST                FLASH_ACR_DCRST_Msk                     
#define FLASH_ACR_BYTE0_ADDRESS_Pos    (10U)                                   
#define FLASH_ACR_BYTE0_ADDRESS_Msk    (0x10008FUL << FLASH_ACR_BYTE0_ADDRESS_Pos) 
#define FLASH_ACR_BYTE0_ADDRESS        FLASH_ACR_BYTE0_ADDRESS_Msk             
#define FLASH_ACR_BYTE2_ADDRESS_Pos    (0U)                                    
#define FLASH_ACR_BYTE2_ADDRESS_Msk    (0x40023C03UL << FLASH_ACR_BYTE2_ADDRESS_Pos) 
#define FLASH_ACR_BYTE2_ADDRESS        FLASH_ACR_BYTE2_ADDRESS_Msk             

/*******************  Bits definition for FLASH_SR register  ******************/
#define FLASH_SR_EOP_Pos               (0U)                                    
#define FLASH_SR_EOP_Msk               (0x1UL << FLASH_SR_EOP_Pos)             
#define FLASH_SR_EOP                   FLASH_SR_EOP_Msk                       
#define FLASH_SR_SOP_Pos               (1U)                                   
#define FLASH_SR_SOP_Msk               (0x1UL << FLASH_SR_SOP_Pos)             
#define FLASH_SR_SOP                   FLASH_SR_SOP_Msk                       
#define FLASH_SR_WRPERR_Pos            (4U)                                   
#define FLASH_SR_WRPERR_Msk            (0x1UL << FLASH_SR_WRPERR_Pos)          
#define FLASH_SR_WRPERR                FLASH_SR_WRPERR_Msk                    
#define FLASH_SR_PGAERR_Pos            (5U)                                   
#define FLASH_SR_PGAERR_Msk            (0x1UL << FLASH_SR_PGAERR_Pos)          
#define FLASH_SR_PGAERR                FLASH_SR_PGAERR_Msk                    
#define FLASH_SR_PGPERR_Pos            (6U)                                   
#define FLASH_SR_PGPERR_Msk            (0x1UL << FLASH_SR_PGPERR_Pos)          
#define FLASH_SR_PGPERR                FLASH_SR_PGPERR_Msk                    
#define FLASH_SR_PGSERR_Pos            (7U)                                   
#define FLASH_SR_PGSERR_Msk            (0x1UL << FLASH_SR_PGSERR_Pos)          
#define FLASH_SR_PGSERR                FLASH_SR_PGSERR_Msk                    
#define FLASH_SR_BSY_Pos               (16U)                                  
#define FLASH_SR_BSY_Msk               (0x1UL << FLASH_SR_BSY_Pos)             
#define FLASH_SR_BSY                   FLASH_SR_BSY_Msk                       

