sownlee/MCAL/env/STM32F407VG/header/Header_FLASH.h
/*******************  Bits definition for FLASH_CR register  ******************/
#define FLASH_CR_PG_Pos                (0U)                                    
#define FLASH_CR_PG_Msk                (0x1UL << FLASH_CR_PG_Pos)              
#define FLASH_CR_PG                    FLASH_CR_PG_Msk                        
#define FLASH_CR_SER_Pos               (1U)                                   
#define FLASH_CR_SER_Msk               (0x1UL << FLASH_CR_SER_Pos)             
#define FLASH_CR_SER                   FLASH_CR_SER_Msk                       
#define FLASH_CR_MER_Pos               (2U)                                   
#define FLASH_CR_MER_Msk               (0x1UL << FLASH_CR_MER_Pos)             
#define FLASH_CR_MER                   FLASH_CR_MER_Msk                       
#define FLASH_CR_SNB_Pos               (3U)                                   
#define FLASH_CR_SNB_Msk               (0x1FUL << FLASH_CR_SNB_Pos)            
#define FLASH_CR_SNB                   FLASH_CR_SNB_Msk                       
#define FLASH_CR_SNB_0                 (0x01UL << FLASH_CR_SNB_Pos)            
#define FLASH_CR_SNB_1                 (0x02UL << FLASH_CR_SNB_Pos)            
#define FLASH_CR_SNB_2                 (0x04UL << FLASH_CR_SNB_Pos)            
#define FLASH_CR_SNB_3                 (0x08UL << FLASH_CR_SNB_Pos)            
#define FLASH_CR_SNB_4                 (0x10UL << FLASH_CR_SNB_Pos)            
#define FLASH_CR_PSIZE_Pos             (8U)                                   
#define FLASH_CR_PSIZE_Msk             (0x3UL << FLASH_CR_PSIZE_Pos)           
#define FLASH_CR_PSIZE                 FLASH_CR_PSIZE_Msk                     
#define FLASH_CR_PSIZE_0               (0x1UL << FLASH_CR_PSIZE_Pos)           
#define FLASH_CR_PSIZE_1               (0x2UL << FLASH_CR_PSIZE_Pos)           
#define FLASH_CR_STRT_Pos              (16U)                                  
#define FLASH_CR_STRT_Msk              (0x1UL << FLASH_CR_STRT_Pos)            
#define FLASH_CR_STRT                  FLASH_CR_STRT_Msk                      
#define FLASH_CR_EOPIE_Pos             (24U)                                  
#define FLASH_CR_EOPIE_Msk             (0x1UL << FLASH_CR_EOPIE_Pos)           
#define FLASH_CR_EOPIE                 FLASH_CR_EOPIE_Msk                     
#define FLASH_CR_ERRIE_Pos             (25U)
#define FLASH_CR_ERRIE_Msk             (0x1UL << FLASH_CR_ERRIE_Pos)
#define FLASH_CR_ERRIE                 FLASH_CR_ERRIE_Msk
#define FLASH_CR_LOCK_Pos              (31U)                                  
#define FLASH_CR_LOCK_Msk              (0x1UL << FLASH_CR_LOCK_Pos)            
#define FLASH_CR_LOCK                  FLASH_CR_LOCK_Msk                       

/*******************  Bits definition for FLASH_OPTCR register  ***************/
#define FLASH_OPTCR_OPTLOCK_Pos        (0U)                                    
#define FLASH_OPTCR_OPTLOCK_Msk        (0x1UL << FLASH_OPTCR_OPTLOCK_Pos)      
#define FLASH_OPTCR_OPTLOCK            FLASH_OPTCR_OPTLOCK_Msk                
#define FLASH_OPTCR_OPTSTRT_Pos        (1U)                                   
#define FLASH_OPTCR_OPTSTRT_Msk        (0x1UL << FLASH_OPTCR_OPTSTRT_Pos)      
#define FLASH_OPTCR_OPTSTRT            FLASH_OPTCR_OPTSTRT_Msk                

#define FLASH_OPTCR_BOR_LEV_0          0x00000004U                            
#define FLASH_OPTCR_BOR_LEV_1          0x00000008U                            
#define FLASH_OPTCR_BOR_LEV_Pos        (2U)                                   
#define FLASH_OPTCR_BOR_LEV_Msk        (0x3UL << FLASH_OPTCR_BOR_LEV_Pos)      
#define FLASH_OPTCR_BOR_LEV            FLASH_OPTCR_BOR_LEV_Msk                
#define FLASH_OPTCR_WDG_SW_Pos         (5U)                                   
#define FLASH_OPTCR_WDG_SW_Msk         (0x1UL << FLASH_OPTCR_WDG_SW_Pos)       
#define FLASH_OPTCR_WDG_SW             FLASH_OPTCR_WDG_SW_Msk                 
#define FLASH_OPTCR_nRST_STOP_Pos      (6U)                                   
#define FLASH_OPTCR_nRST_STOP_Msk      (0x1UL << FLASH_OPTCR_nRST_STOP_Pos)    
#define FLASH_OPTCR_nRST_STOP          FLASH_OPTCR_nRST_STOP_Msk              
#define FLASH_OPTCR_nRST_STDBY_Pos     (7U)                                   
#define FLASH_OPTCR_nRST_STDBY_Msk     (0x1UL << FLASH_OPTCR_nRST_STDBY_Pos)   
#define FLASH_OPTCR_nRST_STDBY         FLASH_OPTCR_nRST_STDBY_Msk             
#define FLASH_OPTCR_RDP_Pos            (8U)                                   
#define FLASH_OPTCR_RDP_Msk            (0xFFUL << FLASH_OPTCR_RDP_Pos)         
#define FLASH_OPTCR_RDP                FLASH_OPTCR_RDP_Msk                    
#define FLASH_OPTCR_RDP_0              (0x01UL << FLASH_OPTCR_RDP_Pos)         
#define FLASH_OPTCR_RDP_1              (0x02UL << FLASH_OPTCR_RDP_Pos)         
#define FLASH_OPTCR_RDP_2              (0x04UL << FLASH_OPTCR_RDP_Pos)         
#define FLASH_OPTCR_RDP_3              (0x08UL << FLASH_OPTCR_RDP_Pos)         
#define FLASH_OPTCR_RDP_4              (0x10UL << FLASH_OPTCR_RDP_Pos)         
#define FLASH_OPTCR_RDP_5              (0x20UL << FLASH_OPTCR_RDP_Pos)         
#define FLASH_OPTCR_RDP_6              (0x40UL << FLASH_OPTCR_RDP_Pos)         
#define FLASH_OPTCR_RDP_7              (0x80UL << FLASH_OPTCR_RDP_Pos)         
#define FLASH_OPTCR_nWRP_Pos           (16U)                                  
#define FLASH_OPTCR_nWRP_Msk           (0xFFFUL << FLASH_OPTCR_nWRP_Pos)       
#define FLASH_OPTCR_nWRP               FLASH_OPTCR_nWRP_Msk                   
#define FLASH_OPTCR_nWRP_0             0x00010000U                             
#define FLASH_OPTCR_nWRP_1             0x00020000U                             
#define FLASH_OPTCR_nWRP_2             0x00040000U                             
#define FLASH_OPTCR_nWRP_3             0x00080000U                             
#define FLASH_OPTCR_nWRP_4             0x00100000U                             
#define FLASH_OPTCR_nWRP_5             0x00200000U                             
#define FLASH_OPTCR_nWRP_6             0x00400000U                             
#define FLASH_OPTCR_nWRP_7             0x00800000U                             
#define FLASH_OPTCR_nWRP_8             0x01000000U                             
#define FLASH_OPTCR_nWRP_9             0x02000000U                             
#define FLASH_OPTCR_nWRP_10            0x04000000U                             
#define FLASH_OPTCR_nWRP_11            0x08000000U                             
                                             
